# Pandas

In [2]:
import pandas as pd 
import numpy as np
pd.__version__ # know the pandas version

'2.2.3'

In [3]:
s=pd.Series([1,2,3,]) # one column
print(s)

0    1
1    2
2    3
dtype: int64

In [4]:
df=pd.DataFrame({
    "name": ["Alice","Bob"],
    "age":[12,34]})
df

    name  age
0  Alice   12
1    Bob   34

## Reading data

In [5]:
df=pd.read_csv(r"C:\Resource\Sample data\people_data.csv")
df

       Name  Age       City
0     Alice   25  Hyderabad
1       Bob   30  Bengaluru
2   Charlie   28    Chennai
3     David   35  Hyderabad
4       Eve   22       Pune
5     Frank   40      Delhi
6     Grace   27  Bengaluru
7    Hannah   24    Chennai
8      Ivan   32       Pune
9      Judy   29  Hyderabad
10    Kevin   34      Delhi
11    Laura   26  Bengaluru
12  Mallory   45    Chennai
13     Niaj   23       Pune
14   Olivia   31  Hyderabad

## writing the data into files

In [6]:
df.to_csv('data.csv',index=False)

## exploring data

In [7]:
df.head()

      Name  Age       City
0    Alice   25  Hyderabad
1      Bob   30  Bengaluru
2  Charlie   28    Chennai
3    David   35  Hyderabad
4      Eve   22       Pune

In [8]:
df.tail()

       Name  Age       City
10    Kevin   34      Delhi
11    Laura   26  Bengaluru
12  Mallory   45    Chennai
13     Niaj   23       Pune
14   Olivia   31  Hyderabad

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    15 non-null     object
 1   Age     15 non-null     int64
 2   City    15 non-null     object
dtypes: int64(1), object(2)
memory usage: 492.0+ bytes

In [10]:
df['Name'][df['Age']=='Laura']

Series([], Name: Name, dtype: object)

In [11]:
df.shape

(15, 3)

In [12]:
df[2:5]

      Name  Age       City
2  Charlie   28    Chennai
3    David   35  Hyderabad
4      Eve   22       Pune

In [13]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [14]:
df.Name

0       Alice
1         Bob
2     Charlie
3       David
4         Eve
5       Frank
6       Grace
7      Hannah
8        Ivan
9        Judy
10      Kevin
11      Laura
12    Mallory
13       Niaj
14     Olivia
Name: Name, dtype: object

In [15]:
df.Age

0     25
1     30
2     28
3     35
4     22
5     40
6     27
7     24
8     32
9     29
10    34
11    26
12    45
13    23
14    31
Name: Age, dtype: int64

In [16]:
df[['Name','Age']]

       Name  Age
0     Alice   25
1       Bob   30
2   Charlie   28
3     David   35
4       Eve   22
5     Frank   40
6     Grace   27
7    Hannah   24
8      Ivan   32
9      Judy   29
10    Kevin   34
11    Laura   26
12  Mallory   45
13     Niaj   23
14   Olivia   31

In [17]:
df.City

0     Hyderabad
1     Bengaluru
2       Chennai
3     Hyderabad
4          Pune
5         Delhi
6     Bengaluru
7       Chennai
8          Pune
9     Hyderabad
10        Delhi
11    Bengaluru
12      Chennai
13         Pune
14    Hyderabad
Name: City, dtype: object

In [18]:
df['Name'].max()

'Olivia'

In [19]:
df['Name'].min()

'Alice'

In [20]:
df['Age'].mean()

np.float64(30.066666666666666)

In [21]:
df['Age'].mode()

0     22
1     23
2     24
3     25
4     26
5     27
6     28
7     29
8     30
9     31
10    32
11    34
12    35
13    40
14    45
Name: Age, dtype: int64

In [22]:
df['Name'].describe()

count        15
unique       15
top       Alice
freq          1
Name: Name, dtype: object

In [23]:
df[df.Name==df.Name.max()]

      Name  Age       City
14  Olivia   31  Hyderabad

In [24]:
df.Age[df.Name==df.Name.max()]

14    31
Name: Age, dtype: int64